Revit 2026 API

# StructuralAssetDensity Property

---

The density of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Density { get; set; }
```
```vb
Public Property Density As Double
	Get
	Set
```
```cpp
public:
property double Density {
	double get ();
	void set (double value);
}
```
```fsharp
member Density : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for density must be non-negative. |

Values are in kilograms per cubed feet (kg/ft³) and must be non-negative.

#### Reference

StructuralAsset Class

Autodesk.Revit.DB Namespace